{"AprendendoCodando":"E-learning project","bad_design":"poorly formulated design","bad_usability":"bad usability","challenge":"Challenge","challenge_context":"Create a free, modern and easy-to-use interactive Brazilian e-learning platform.","code":"Code","deprecated_content":"deprecated content","hifi_wireframe":"high fidelity wireframing","hifi_wireframe_context":"High fidelity wireframing is already a state where the application is almost complete, the last changes related to the design will be made there, but this step is not subject to too many changes. The tool used to execute this demand was figma, and the link to the high-fidelity wireframe is as follows:","lofi_wireframe":"low fidelity wireframing","lofi_wireframe_context":"Wireframing is a crucial concept of interface design and user experience, which allows the visualization of the initial skeleton of the application. This first design is important and low fidelity, so changes may be made during this process.","non_intuitive_knowledge":"non-intuitive teaching","process":"Process","prototype":"Prototyping","prototype_context":"After the research stage and researching the main problems that must be addressed in order to have an effective Brazilian e-learning platform, the prototyping stage begins, which in my view is reduced to two sub-stages.","research":"Search","research_context":"For the development of this platform the first step was the research. An survey that researched most popular e-learning platforms, and what are the problems of these platforms, from this analysis some flaws were found.","result_context":"The application produced a satisfactory result, an effective work regarding UX/UI concepts and clean code standards, also following gitflow concepts and the agile model. To the right it follows the application link and below its design.","used_tech":"The technologies used were the following:","validate_result":"Validating the Result","validation":"Validation","website_motto":"Aprendendo Codando is an online learning platform. Our goal is to teach programming languages.","website_structure":"Website structure","wireframing_types":"Wireframing (low and high fidelity)"}