{"AprendendoCodando":"Projeto e-learning","bad_design":"Design mal formulado","bad_usability":"\nUsabilidade ruim","challenge":"Desafio","challenge_context":"              Criar uma plataforma brasileira de aprendizado e-learning\n              interativa, gratuita, moderna e de fácil uso.","code":"Código","deprecated_content":"Conteúdo depreciado","hifi_wireframe":"Wireframing de alta fidelidade","hifi_wireframe_context":"Wireframing de alta fidelidade já é um estado onde a aplicação já esta modelada quase por completo, as ultimas alterações relativas ao \ndesign serão feitas ali, mas esta etapa não está sujeita à muitas mudanças. A ferramenta utilizada para executar esta demanda foi o figma, \ne o link do wireframe de alta fidelidade é o seguinte :","lofi_wireframe":"Wireframing de baixa fidelidade","lofi_wireframe_context":"Wireframing é um conceito crucial de design de interfaces e experiências de usuário, que permite a visualização do esqueleto \ninicial da aplicação. Este primeiro design é importante e de baixa fidelidade, poderão ser feitas alterações no decorrer deste processo.\n","non_intuitive_knowledge":"Ensino não intuitivo","process":"Processo","prototype":"Prototipação","prototype_context":"Após a etapa de pesquisa e delimitar os principais problemas que devem ser abordados para se ter uma plataforma \ne-learning brasileira efetiva, tem se início a etapa da prototipação, que na minha concepção se reduz em duas sub-etapas.","research":"Pesquisa","research_context":"                Para a construção desta plataforma o primeiro passo foi à\n                pesquisa. Uma pesquisa referente à um grande número de\n                plataformas e-learning, e quais os problemas destas plataformas,\n                a partir desta análise foram encontradas algumas falhas.","result_context":"A aplicação produziu um resultado satisfatório, um trabalho efetivo quanto aos conceitos de UX/UI e padrões de código limpo, seguindo também \nconceitos de gitflow e o modelo agile. Ao lado segue o link da aplicação e abaixo o seu design.","used_tech":"As tecnologias utilizadas foram as seguintes:","validate_result":"Validando o Resultado","validation":"Validação","website_motto":"              Aprendendo a codar é uma plataforma online de aprendizado. E o\n              nosso objetivo é ensinar linguagens de programação.","website_structure":"Estrutura do website","wireframing_types":"Wireframing (baixa e alta fidelidade)"}